
#Область include_BlocklyExecutor_base_Variables
#КонецОбласти

#Область include_BlocklyExecutor_base_VariableSABYHTTPClient
#КонецОбласти

&НаКлиенте
Перем ГлобальныйКэш Экспорт;

&НаКлиенте
Перем СбисРаботаСJSON, ГлавноеОкно;

#Область include_core2_vo2_Модуль_Обработчики_Загрузка
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_АПИ
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Клиент
#КонецОбласти

#Область include_core2_vo2_МодульОбъекта_Сервер
#КонецОбласти

#Область include_local_vo2_МодульОбъекта_ТолстыйКлиентОбычноеПриложение
#КонецОбласти


