
&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Получатель) Тогда
		ПолучательВСписке = ИсторияПолучатели.НайтиПоЗначению(Получатель);
		Если ПолучательВСписке<>Неопределено Тогда
			ИсторияПолучатели.Удалить(ПолучательВСписке)	
		КонецЕсли;
		ИсторияПолучатели.Вставить(0, Получатель);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеКонтрагента(Контрагент)
	Представление = "";
	Для Каждого СтруктураИни из МестныйКэш.ини Цикл
		Если Нрег(СтруктураИни.Ключ)="конфигурация" Тогда
			Ини = СтруктураИни.Значение;
			Прервать;
		КонецЕсли;	 
	КонецЦикла;
	Рекв_ИНН = СтруктураИни.Значение.Контрагенты_ИНН.Значение;
	Рекв_КПП = СтруктураИни.Значение.Контрагенты_КПП.Значение; 
	фрм = МестныйКэш.ГлавноеОкно.сбисПолучитьФорму("РаботаСДокументами1С");
	ИНН = фрм.ПолучитьРеквизитОбъекта(Контрагент,фрм.сбисСообщитьИмяРеквизита(Рекв_ИНН));
	Представление = Строка(Контрагент)+" ("+ИНН;
	Если СтрДлина(СокрЛП(ИНН))=10 Тогда
		КПП = фрм.ПолучитьРеквизитОбъекта(Контрагент,фрм.сбисСообщитьИмяРеквизита(Рекв_КПП));				 
		Представление = Представление +"/"+КПП;
		КонецЕсли;
	Представление = Представление +")";
	
	Возврат Представление;
	
КонецФункции	

&НаКлиенте
Процедура ИсторияПолучателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные.Значение <> Получатель Тогда
		Получатель = Элемент.ТекущиеДанные.Значение;
		ПолучательПриИзменении("");
	КонецЕсли;
КонецПроцедуры

//ОП
Процедура ПриОткрытии()
	ВосстановитьИсториюПолучателей();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохранитьИсториюПолучателей();
КонецПроцедуры

Процедура ВосстановитьИсториюПолучателей() Экспорт
	ИсторияПолучатели = ВосстановитьЗначение("ИсторияПолучателиПересылки");
КонецПроцедуры

Процедура СохранитьИсториюПолучателей()
	ИсторияПолучатели3 = Новый СписокЗначений;
	сч = 0;
	Для Каждого Элемент Из ИсторияПолучатели Цикл
		ИсторияПолучатели3.Добавить(Элемент.Значение);
		сч = сч+1;
		Если сч>2 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	СохранитьЗначение("ИсторияПолучателиПересылки",ИсторияПолучатели3);
КонецПроцедуры

Процедура ИсторияПолучателиПередНачаломДобавления(Элемент, Отказ, Копирование)
	Отказ = Истина;
КонецПроцедуры

