
#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

//////////////////////////////////////////////////////////////////////////////////

////////////////////// Обычное приложение/////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
Функция ПриОткрытииИзвне() Экспорт	
	ПослеУстановитьРасширениеРаботыСФайлами();
	Возврат Кэш;
КонецФункции
Функция сбисОтправкаИзвне(МассивСтрок) Экспорт	
	ПриОткрытииИзвне();
	фрм = сбисПолучитьФорму("Документ_Шаблон");
	Кэш.Текущий.Вставить("Форма",сбисПолучитьФорму("Раздел_Продажа_Шаблон"));
	фрм.ОтправитьДокументы(Кэш,МассивСтрок);
КонецФункции
Процедура ЗаписейНаСтраницеПриИзменении(Элемент)
	// Меняет количество отбражаемых записей в реестрах СБИС	
	ФильтрСтраница = 1;
	ПараметрыПриИзменении(Элемент);
	ОбновитьКонтент();
КонецПроцедуры

// Процедура - обновляет данные на главном окне
//
// Параметры:
//  СтруктураДляОбновленияФормы	 - Стуктура	 - Элементы для заполнения реестров
//
Процедура ОбновитьПоляФормы(СтруктураДляОбновленияФормы) Экспорт		
	
	Если НЕ ТипЗнч(СтруктураДляОбновленияФормы) = Тип("Структура") Тогда  
		
		Возврат;
		
	КонецЕсли;    
	
	ПараметрыСерилизации = Новый Структура("Тип");
	
	Для Каждого Элемент Из СтруктураДляОбновленияФормы Цикл 
		
		Если ТипЗнч(ЭтаФорма[Элемент.Ключ]) = Тип("ТаблицаЗначений") Тогда 
			
			ЭтаФорма[Элемент.Ключ].Очистить(); 
			
			Если НЕ ЗначениеЗаполнено(Элемент.Значение) Тогда
				Продолжить;
			КонецЕсли;  

			Для Каждого Стр Из Элемент.Значение Цикл
				СтрТ = ЭтаФорма[Элемент.Ключ].Добавить();
				ЗаполнитьЗначенияСвойств(СтрТ, Стр);		
			КонецЦикла;

			// Убираем возможность настраивать колонки, работа с которыми не предусмотрена
			Для каждого Колонка Из ЭлементыФормы[Элемент.Ключ].Колонки Цикл
			
				Колонка.ИзменятьВидимость	= Элемент.Значение[0].Свойство(Колонка.Имя);
				Колонка.ИзменятьНастройку	= Элемент.Значение[0].Свойство(Колонка.Имя); 
				Колонка.ИзменятьПозицию		= Элемент.Значение[0].Свойство(Колонка.Имя);

			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ЭтаФорма[Элемент.Ключ]) = Тип("ДеревоЗначений") Тогда 
			
			ПараметрыСерилизации.Тип = "ДеревоЗначений";
            НовыйОбъект = МодульОбъектаСервер().СериализоватьМассивСтруктурВОбъект(Элемент.Значение, ПараметрыСерилизации);
			ЭтаФорма[Элемент.Ключ] = НовыйОбъект; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#Область include_core2_vo2_ОбщиеФункции_ФормаГлавноеОкно_Аккордеон
#КонецОбласти

#Область include_core2_vo3_Аккордеон
#КонецОбласти

Процедура ТаблДокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	// Оформление строки таблицы документов	
	Попытка
		фрм = ЭтотОбъект.ПолучитьФорму(Элемент.Имя);
	Исключение	
		Сообщить("Нет формы для '"+Элемент.Имя+"'");
	КонецПопытки;	
	фрм.ТаблДокПриВыводеСтроки(Кэш, Элемент, ОформлениеСтроки, ДанныеСтроки);
КонецПроцедуры

//Процедура ОткрытьПанельМассовыхОпераций(Элемент)
//	ЭлементыФормы.ПанельМассовыхОпераций.Видимость = Истина;
//КонецПроцедуры
//Процедура ЗакрытьПанельМассовыхОпераций(Элемент)
//	ЭлементыФормы.ПанельМассовыхОпераций.Видимость = Ложь;
//КонецПроцедуры
Процедура ТабУстановленныеИниФайлыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	// Процедура отключает выбранный файл настроек
	СтрокиОбработать = Новый Массив();
	СтрокиОбработать.Добавить(ВыбраннаяСтрока);
	Кэш.ФормаНастроекОбщее.сбисОтключитьФайлыНастроек(Кэш, СтрокиОбработать);
КонецПроцедуры

// Закрывает панель фильтра	
Процедура ФильтрЗакрытьПанельУстановки(Элемент = Неопределено)
	
	ЭлементыФормы.ПанельУстановкиФильтра.Видимость = Ложь;
	
КонецПроцедуры

Процедура ФильтрУстановить(Элемент)
	
	// Обновляет данные в соответствии с выбранными параметрами фильтра	
	ФильтрЗакрытьПанельУстановки();
	
	СтруктураРазделаГО = Кэш.Текущий;
	
	ЗаполнитьЗначенияСвойств(СтруктураРазделаГО.Фильтр, ЭтаФорма);
	
	ФормаДопФильтра	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("сбисСписокДопПараметровФильтра",
																		СтруктураРазделаГО.ОписаниеРаздела.ФормыФильтра);
		
	Если Не ФормаДопФильтра = Ложь Тогда
																			
		УстановитьДополнительныеПараметрыФильтра(ФормаДопФильтра);
		
	КонецЕсли;
	
	СбисПослеУстановкиФильтра(Истина, Новый Структура);
	
КонецПроцедуры
Процедура ФильтрУстановитьВидимость(Период)
	// Устанавливает видимость элементов фильтра	
	Если Период = "За период" Тогда
		ЭтаФорма.ЭлементыФормы.ФильтрДатаНач.Видимость = Истина;
		ЭтаФорма.ЭлементыФормы.ФильтрДатаКнц.Видимость = Истина;
		ЭтаФорма.ЭлементыФормы.НадписьФильтрДатаНач.Видимость = Истина;
		ЭтаФорма.ЭлементыФормы.НадписьФильтрДатаКнц.Видимость = Истина;
	Иначе 
		ЭтаФорма.ЭлементыФормы.ФильтрДатаНач.Видимость = Ложь;
		ЭтаФорма.ЭлементыФормы.ФильтрДатаКнц.Видимость = Ложь;
		ЭтаФорма.ЭлементыФормы.НадписьФильтрДатаНач.Видимость = Ложь;
		ЭтаФорма.ЭлементыФормы.НадписьФильтрДатаКнц.Видимость = Ложь;
	КонецЕсли;
	
    //По умолчанию устанавливаем видимость для полей Контрагент, Состояние, Организация
	СбисПолучитьЭлементФормы(ЭтаФорма, "ФильтрКонтрагент").Видимость 	= Истина;
	СбисПолучитьЭлементФормы(ЭтаФорма, "ФильтрОрганизация").Видимость	= Истина;
	СбисПолучитьЭлементФормы(ЭтаФорма, "ФильтрСостояние").Видимость		= Истина;

КонецПроцедуры

Процедура ФильтрУстановитьВидимостьПослеЗаполнения()

	ЭлементыФормы.ПанельУстановкиФильтра.Видимость = Истина;

	ЭлементыФормы.ФильтрСостояние.СписокВыбора	= СписокСостояний;
	ЭлементыФормы.ФильтрСостояние.Значение		= ФильтрСостояние;
	
	ЭлементыФормы.ФильтрТипыДокументов.СписокВыбора	= МодульОбъектаКлиент().ФильтрТипыДокументовСписок();	
	ЭлементыФормы.ФильтрТипыДокументов.Значение		= ФильтрТипыДокументов;

КонецПроцедуры

Процедура ФильтрПриИзмененииПериода(Элемент)
	// Рассчитывает начальную и конечную дату в зависимости от выбранного периода	
	Значение = Элемент.Значение;
	ФильтрУстановитьВидимость(Значение);
	Если	ФильтрПериод = "За сегодня" Тогда
		
		ФильтрДатаНач = ТекущаяДата();
		ФильтрДатаКнц = ТекущаяДата();
		
	ИначеЕсли	ФильтрПериод = "За последний месяц" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-1);
		
	ИначеЕсли	ФильтрПериод = "За последние полгода" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц,-6);
		
	ИначеЕсли	ФильтрПериод = "За последний год" Тогда
		
		ФильтрДатаКнц = ТекущаяДата();
		ФильтрДатаНач = ДобавитьМесяц(ФильтрДатаКнц, -12);
		
	Иначе//		ФильтрПериод = "За весь период"
		
		ФильтрДатаНач = "";
		ФильтрДатаКнц = "";

	КонецЕсли;
	
КонецПроцедуры
Процедура ФильтрТипыДокументовНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	Для Каждого элементВыбора из Элемент.СписокВыбора цикл		
		Если ФильтрТипыДокументов.НайтиПоЗначению(элементВыбора.значение) <>неопределено Тогда
			элементВыбора.Пометка=истина;
		КонецЕсли;
	КонецЦикла;
	
	Элемент.СписокВыбора.ОтметитьЭлементы("Выберите типы");
	ФильтрТипыДокументов.Очистить();
	Для Каждого элементВыбора из Элемент.СписокВыбора цикл
		Если элементВыбора.Пометка Тогда
			ФильтрТипыДокументов.Добавить(элементВыбора.значение, элементВыбора.представление);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
// Навигация
Процедура КоманднаяПанельНавигацияПоСтраницам(Кнопка)
	// Осуществляет переход по страницам в реестрах СБИС	
	Если Кнопка.Имя = "НавигацияПерваяСтраница" Тогда
		ФильтрСтраница = 1;
	КонецЕсли;
	Если Кнопка.Имя = "НавигацияПредыдущаяСтраница" Тогда
		ФильтрСтраница = ФильтрСтраница-1;
	КонецЕсли;
	Если Кнопка.Имя = "НавигацияСледующаяСтраница" Тогда
		ФильтрСтраница = ФильтрСтраница+1;
	КонецЕсли;
	Если Кнопка.Имя = "НавигацияПоследняяСтраница" Тогда
		ФильтрСтраница = 0;
	КонецЕсли;
	ОбновитьКонтент();
КонецПроцедуры

Процедура ОтметитьВсеПриИзменении(Элемент)
	// Отмечает все записи в таблице документов	
	Для Каждого Строка Из Кэш.ТаблДок.Значение Цикл
		Строка.Отмечен = Элемент.Значение;
	КонецЦикла;
КонецПроцедуры

// Утверждение/Отклонение
Процедура КонтекстноеМенюПолученныеУтвердитьОтклонить(Кнопка)
	// Выполняет утверждение/отклонение отмеченных документов	
	СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
	фрм = сбисНайтиФормуФункции("сбисУтвердитьОтклонить","РаботаСДокументами1С","",Кэш);
	фрм.сбисУтвердитьОтклонить(Кэш,СписокОтмеченныхДокументов, Кнопка.Имя);
	ОбновитьКонтент();
КонецПроцедуры

Процедура МассовыеОперацииАннулироватьАннулироватьВыделенные(Кнопка)
	СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
	Если СписокОтмеченныхДокументов.Количество() Тогда
		
		ПараметрыВыбораСписка = Новый Структура("Заголовок, Обработчик", "Укажите комментарий", 
		МодульОбъектаКлиент().НовыйСбисОписаниеОповещения("ОбработатьПолученныйКомментарий", ЭтаФорма, Новый Структура("Кэш", Кэш)));   
		МодульОбъектаКлиент().СбисПоказатьПолеВвода(ПараметрыВыбораСписка);
		
	Иначе 
		Сообщить("Не выбран ни один документ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйКомментарий(Значение, ДопПараметры = Неопределено) Экспорт 
	Если  ЗначениеЗаполнено(Значение)  Тогда
		
		СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
		фрм = сбисНайтиФормуФункции("СбисАннулироватьЗаказОтправленный", "РаботаСДокументами1С", "", Кэш);
		фрм.СбисАннулироватьЗаказОтправленный(СписокОтмеченныхДокументов, Значение);
		
	Иначе
		Сообщить("Нет комментария");
КонецЕсли;

КонецПроцедуры
&НаКлиенте
Функция ОбновитьКонтент(АргументВходящие = Неопределено, ДопПараметры = Неопределено) Экспорт
	// Обновляет данные на главном окне	
	Если Кэш.ТаблДок = "" Тогда   // Если открыта сама обработка, а отправку делаем из карточки документа 1С, то ничего не обновляем
		Возврат "";
	КонецЕсли;
	//Получим имя и значение реквизита по которому будем искать текущую строку
	ЗначениеПоиска = Неопределено;
	Если ТипЗнч(Кэш.ТаблДок.ТекущиеДанные) <> Тип("Неопределено") Тогда
		Если Кэш.ТаблДок.Имя = "Таблица_РеестрДокументов" Тогда
			РеквизитПоиска = "Документ1С";
		Иначе
			РеквизитПоиска = "ИдСБИС";
		КонецЕсли;
		Попытка
			ЗначениеПоиска = Кэш.ТаблДок.ТекущиеДанные[РеквизитПоиска]	
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	СтруктураДляОбновленияФормы = Кэш.Текущий.Форма.ОбновитьКонтент(Кэш);
	ОбновитьПоляФормы(СтруктураДляОбновленияФормы);
	
	//Найдем строку в новой таблице по имени и значению реквизита
	Если ЗначениеПоиска <> Неопределено и ТипЗнч(СтруктураДляОбновленияФормы) = Тип("Структура") Тогда
		Для Каждого Элемент Из СтруктураДляОбновленияФормы Цикл
			ТаблПоиска = ЭтаФорма[Элемент.Ключ];
			ПараметрыОтбора = Новый Структура(РеквизитПоиска, ЗначениеПоиска);
			Строка = ТаблПоиска.НайтиСтроки(ПараметрыОтбора);
			//Берем первую строку из массива (Т.к. поиск по документу или по ИдСБИС, то строка единственная в таблице)
			Если Строка.Количество() <> 0 Тогда
				Кэш.ТаблДок.ТекущаяСтрока = Строка[0];
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура СохранитьПакет(Элемент)
	// Сохраняет пакеты документов на диск (+ pdf файлы вложений)	
	СписокОтмеченныхДокументов = ТаблДокПолучитьВыбранныеСтроки();
	СписокПакетов = Новый массив;
	Для Каждого Элемент Из СписокОтмеченныхДокументов Цикл
		СписокПакетов.Добавить(Элемент.Значение.СоставПакета[0].Значение);
	КонецЦикла;
	Кэш.ОбщиеФункции.СохранитьПакетыНаДиск(Кэш, СписокПакетов);
КонецПроцедуры
//Процедура ФильтрПриИзменении(Элемент)
//	Кэш.ПараметрыФильтра.Вставить(Элемент.Имя, Элемент.Значение);
//КонецПроцедуры
//Вынесено на форму общей работы с настройками
//Функция ДобавитьСбисДополнительныеПараметрыФильтра(ФормаДопФильтра) Экспорт
//	// Добавляет на форму главного окна все элементы пользовательских фильтров	
//	СписокДопЭлементов =  ФормаДопФильтра.сбисСписокДопПараметровФильтра();
//	ЭтаФорма.ЭлементыФормы.ПанельУстановкиФильтра.Высота = ФормаДопФильтра.ЭлементыФормы.ПанельУстановкиФильтра.Высота;
//	Для Каждого ДопЭлемент Из СписокДопЭлементов Цикл
//		Попытка  // на случай, если один и тот же элемент используется в нескольких разделах
//			Элемент = ФормаДопФильтра.ЭлементыФормы[ДопЭлемент.Значение];
//			ЭтаФорма.ЭлементыФормы.Добавить(ТипЗнч(Элемент), Элемент.Имя, Истина, ЭтаФорма.ЭлементыФормы.ПанельУстановкиФильтра);
//			Если ТипЗнч(Элемент) = Тип("ПолеВвода") или ТипЗнч(Элемент) = Тип("ПолеВыбора") или ТипЗнч(Элемент) = Тип("Флажок") Тогда
//				ЭтаФорма.ЭлементыФормы[Элемент.Имя].ТипЗначения = Элемент.ТипЗначения;
//				ЭтаФорма.ЭлементыФормы[Элемент.Имя].ЦветТекстаКнопки = Элемент.ЦветТекстаКнопки;
//				ЭтаФорма.ЭлементыФормы[Элемент.Имя].ЦветФонаКнопки = Элемент.ЦветФонаКнопки;
//				ЭтаФорма.ЭлементыФормы[Элемент.Имя].ЦветРамки = Элемент.ЦветРамки;
//				Если ТипЗнч(Элемент) <> Тип("Флажок") Тогда
//					ЭтаФорма.ЭлементыФормы[Элемент.Имя].КнопкаВыбора = Элемент.КнопкаВыбора;
//				КонецЕсли;
//				Кэш.ПараметрыФильтра.Вставить(Элемент.Имя,Элемент.Значение);
//			КонецЕсли;
//			Если ТипЗнч(Элемент) = Тип("Флажок") Тогда
//				ЭтаФорма.ЭлементыФормы[Элемент.Имя].Заголовок = Элемент.Заголовок;
//			КонецЕсли;
//			Если ТипЗнч(Элемент) = Тип("ПолеВыбора") Тогда
//				ЭтаФорма.ЭлементыФормы[Элемент.Имя].СписокВыбора = Элемент.СписокВыбора;
//			КонецЕсли;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].Значение = Элемент.Значение;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].Высота = Элемент.Высота;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].Ширина = Элемент.Ширина;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].Лево = Элемент.Лево;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].Верх = Элемент.Верх;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].ЦветТекста = Элемент.ЦветТекста;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].Видимость = Ложь;
//			ЭтаФорма.ЭлементыФормы[Элемент.Имя].Шрифт = Элемент.Шрифт;
//		Исключение
//		КонецПопытки;
//	КонецЦикла;
//	
//КонецФункции
&НаКлиенте
Процедура ВерсияНажатие(Элемент)
	// Открывает хистори обработки. 
	Если Не (Кэш.Парам.СпособОбмена = 0 Или Кэш.Парам.СпособОбмена = 2) Тогда
		ФормаНовости = сбисПолучитьФорму("ФормаНовости",,,ЭтаФорма);
	    ФормаНовости.Открыть();        
	Иначе 
		ЗапуститьПриложение("https://sbis.ru/help/integration/sdk");
	КонецЕсли;
	
КонецПроцедуры

Процедура сбисЗаполнитьСписокСправочника(Ини) Экспорт
	// Заполняет дерево значений по справочнику
	ИмяСправочника = СокрЛП(Сред(Ини.СправочникТип.Значение, Найти(Ини.СправочникТип.Значение, ".")+1));
	Если Ини.Свойство("ЗапросСпискаЭлементов") Тогда
		ТекстЗапроса = СокрЛП(Ини.ЗапросСпискаЭлементов.Значение);
		Запрос = Новый Запрос(Сред(ТекстЗапроса,2,СтрДлина(ТекстЗапроса)-2));
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ЗаписьСправочника.Ссылка,ЗаписьСправочника.Наименование,ЗаписьСправочника.Код, Ложь КАК Отмечен ИЗ Справочник."+ИмяСправочника+" КАК ЗаписьСправочника ГДЕ (НЕ(ЗаписьСправочника.ЭтоГруппа) и НЕ ЗаписьСправочника.ПометкаУдаления)ИТОГИ ПО ЗаписьСправочника.Ссылка ТОЛЬКО ИЕРАРХИЯ");
	КонецЕсли;
	Таблица_РеестрСправочников = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецПроцедуры

&НаКлиенте
Процедура ПометкаПриИзменении(Элемент)
	// Отмечает вложенные записи дерева значений при отметке группы
	ТекущиеДанные = ЭлементыФормы.Таблица_РеестрСправочников.ТекущиеДанные;
	ПроставитьПометкиВниз(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВниз(ТекущиеДанные)
	// Отмечает вложенные записи дерева значений при отметке группы
	Потомки = ТекущиеДанные.Строки;
	Значение = ТекущиеДанные.Отмечен;
	Для каждого Потомок из Потомки Цикл
		Потомок.Отмечен = Значение;
		ПроставитьПометкиВниз(Потомок);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВыбранныеСтроки(СписокОтмеченных, Потомки)
	// Получает выбранные строки дерева значений
	Для каждого Потомок из Потомки Цикл
		ПотомкиПотомка = Потомок.Строки;
		Если ПотомкиПотомка.Количество()=0 Тогда
			Если Потомок.Отмечен = Истина Тогда
				СписокОтмеченных.Добавить(Потомок.Ссылка);
			КонецЕсли;
		Иначе
			ПолучитьВыбранныеСтроки(СписокОтмеченных,ПотомкиПотомка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеДерево(Команда)
	// Отмечает все записи в дереве значений
	Потомки = Таблица_РеестрСправочников.Строки;
	Для Каждого Потомок Из Потомки Цикл
		Потомок.Отмечен = ОтметитьВсе;
		ПроставитьПометкиВниз(Потомок);
	КонецЦикла;
КонецПроцедуры

Процедура ОткрытьЗаписьСправочника(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	// Открывает карточку записи справочника
	ОткрытьЗначение(ВыбраннаяСтрока.Ссылка);
КонецПроцедуры

Процедура Таблица_НоменклатураКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	// Пока не нужно
	// ИзменитьНоменклатуру();
КонецПроцедуры

//Список клиентских форм формируется при подключении заплаток
&НаКлиенте
Процедура ОтправитьКорреспонденцию(Команда)
	фрм = сбисНайтиФормуФункции("ПоказатьФорму","ФормаОтправкиКорреспонденции","",Кэш);	
	фрм.ПоказатьФорму(Кэш);
КонецПроцедуры

//&НаСервере
Процедура НастроитьКолонкиНаСервере(имяТаблицы, Знач ВидимыеКолонки, Ини) экспорт  // alo СтатусГос
	// Создание ТаблицыЗначений с описанием колонок
	ЭлементТаблица = ЭлементыФормы[имяТаблицы];
	РеквизитТаблица = Этаформа[имяТаблицы];
	индекс = 0;
	Для Каждого Колонка Из ВидимыеКолонки Цикл
		Если ини.Свойство("Реестр1С_"+Колонка.Имя) Тогда
			Колонка.Ини = ини["Реестр1С_"+Колонка.Имя];
		КонецЕсли;
		КолонкаТЗ = РеквизитТаблица.Колонки.Найти(Колонка.Имя);
		Если КолонкаТЗ = Неопределено Тогда
			ОписаниеТипа = Неопределено;
			Если Колонка.Ини.Свойство("Тип") Тогда
				Если Колонка.Ини.Тип = "Строка" Тогда
	 				КвалификаторыСтроки = Новый КвалификаторыСтроки;
	    			ОписаниеТипа = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
				Иначе
	    			ОписаниеТипа = Новый ОписаниеТипов(Колонка.Ини.Тип);	// например "СправочникСсылка.Сотрудники"
	 			КонецЕсли;
	 		КонецЕсли;
			КолонкаТЗ = РеквизитТаблица.Колонки.Добавить(Колонка.Имя,ОписаниеТипа); 
		КонецЕсли;
		Колонка.Элемент = ЭлементТаблица.Колонки.Найти(Колонка.Имя);
		Если Колонка.Элемент = Неопределено Тогда
			Колонка.Элемент = ЭлементТаблица.Колонки.Вставить(индекс); 
			Колонка.Элемент.Имя = Колонка.Имя;
			Колонка.Элемент.УстановитьЭлементУправления(Тип("ПолеВвода"));	
			Колонка.Элемент.Положение = ПоложениеКолонки.ВТойЖеКолонке;
			Колонка.Элемент.Ширина = 10;
		КонецЕсли;
		Колонка.Элемент.Видимость = Истина;
		Если Колонка.Ини.Свойство("Ширина") Тогда
			Попытка	// у существующих поле переключателей и картинок такого свойства нет
				Колонка.Элемент.Ширина = Колонка.Ини.Ширина;
			Исключение;
			КонецПопытки
		КонецЕсли;
		Если Колонка.Ини.Свойство("Заголовок") Тогда
			Колонка.Элемент.ТекстШапки = Колонка.Ини.Заголовок;
		КонецЕсли;
		Если Колонка.Ини.Свойство("Значение") Тогда
			Колонка.Элемент.Данные = Колонка.Ини.Значение;
		КонецЕсли;
		индекс = индекс +1;
	КонецЦикла;	
КонецПроцедуры

//Процедура управляет включением/отключением вывода логов
&НаКлиенте
Процедура сбисПереключитьОтладку()
	Если РежимОтладки Тогда
		Кэш.Интеграция.ВключитьОтладку(Кэш, КаталогОтладки);
	Иначе
		Кэш.Интеграция.ОтключитьОтладку(Кэш);
	КонецЕсли;	
	
	Кэш.Парам.РежимОтладки	= РежимОтладки;
	Кэш.Парам.КаталогОтладки= КаталогОтладки;
	сбисЭлементФормы(ЭтаФорма, "КаталогОтладки").Видимость = РежимОтладки;
	//+++ МАИ 09.09.2021 Переопределяем сервер обновлений, если пользователь в режиме отладки указал другой
	сбисЭлементФормы(ЭтаФорма, "АдресСервисаОбновлений").Видимость = РежимОтладки;
	сбисЭлементФормы(ЭтаФорма, "НадписьАдресСервисаОбновлений").Видимость = РежимОтладки;	
	Если НЕ РежимОтладки ИЛИ АдресСервисаОбновлений = "" Тогда
		АдресСервисаОбновлений = "update.sbis.ru";
		Кэш.СБИС.ПараметрыИнтеграции.Вставить("АдресСервисаОбновлений", АдресСервисаОбновлений);
	КонецЕсли;
	//--- МАИ 09.09.2021
КонецПроцедуры

Процедура ПользовательНажатие(Элемент)
	ОткрытьФормуПереключенияАккаунта();
КонецПроцедуры

#Область include_core_base_Helpers_FormElements802
#КонецОбласти

#Область include_core_base_Helpers_XDTO
#КонецОбласти

