Процедура ТаблДокПриВыводеСтроки(Кэш, Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	// Оформление строки таблицы документов
	
	Если ДанныеСтроки.Статус <> -1 Тогда
		ОформлениеСтроки.Ячейки.Статус.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.Статус.ИндексКартинки = ДанныеСтроки.Статус;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Статус.ОтображатьТекст = Ложь;
	
	Если НЕ Элемент.Колонки.Найти("Документ1С") = Неопределено
		И ЗначениеЗаполнено(ДанныеСтроки.Документ1С)
		И НЕ ДанныеСтроки.Документ1С.Пустая() Тогда
		
		Документ1С = ДанныеСтроки.Документ1С;
	ИначеЕсли НЕ Элемент.Колонки.Найти("Документы1С") = Неопределено 
		И ЗначениеЗаполнено(ДанныеСтроки.Документы1С)
		И ДанныеСтроки.Документы1С.Количество() Тогда
		
		Документ1С = ДанныеСтроки.Документы1С[0].Значение;
	Иначе
		Документ1С = Неопределено
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ1С)
		И НЕ Найти("3#4", Кэш.Текущий.Раздел) Тогда
		
		Попытка 
			ДельтаСтроки = Число(ДанныеСтроки.Сумма) - Число(Документ1С.СуммаДокумента);
			ДельтаСтроки = ?(ДельтаСтроки < 0, -ДельтаСтроки, ДельтаСтроки);
		Исключение
			ДельтаСтроки = 0;
		КонецПопытки;
		
		Если ДельтаСтроки > Кэш.Парам.СопоставлениеПоСумме Тогда
			ОформлениеСтроки.Ячейки.Сумма.ЦветФона = Новый Цвет(255,209,209);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Элемент.Колонки.Найти("Проведен") = Неопределено
		И ЗначениеЗаполнено(Документ1С) Тогда
	
		ОформлениеСтроки.Ячейки.Проведен.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.Проведен.ИндексКартинки = ДанныеСтроки.Проведен;
		ОформлениеСтроки.Ячейки.Проведен.ОтображатьТекст = Ложь;
		
	ИначеЕсли НЕ Элемент.Колонки.Найти("Проведен") = Неопределено Тогда
		ОформлениеСтроки.Ячейки.Проведен.ОтображатьТекст = Ложь;
	КонецЕсли;
	
	Если Элемент.Колонки.Найти("Расхождение")<>Неопределено Тогда
		
		ОформлениеСтроки.Ячейки.Расхождение.ОтображатьТекст = Ложь;
		ОформлениеСтроки.Ячейки.Расхождение.ОтображатьКартинку = Истина;
		
		Если ДанныеСтроки.Расхождение Тогда
			ОформлениеСтроки.Ячейки.Расхождение.ИндексКартинки = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеСтроки.Номер = "Загрузить еще" Тогда
	
		ОформлениеСтроки.Ячейки.Номер.ЦветТекста = Новый Цвет(0, 0, 255);
		ОформлениеСтроки.Ячейки.Номер.Шрифт = Новый Шрифт(,,,, Истина);
		ОформлениеСтроки.Ячейки.Отмечен.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.Отмечен.ОтображатьФлажок = Ложь;
	
	КонецЕсли;

КонецПроцедуры