Перем Кэш;

#Область include_local_ПолучитьМодульОбъекта
#КонецОбласти

Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

Функция ОбновитьКонтент(ЛокальныйКэш) Экспорт
	
	// СтруктураДляОбновленияФормы = Кэш.ОбщиеФункции.сбисОбновитьРеестрДокументов1С(Ини, Кэш);
	
	Кэш = ЛокальныйКэш;
	ИмяРаздела = "Справочники";	
	ИмяРеестра = "НоменклатураКонтрагентов";
	
	Кэш.Текущий.ТипДок = ИмяРеестра;
	ГлавноеОкно				= Кэш.ГлавноеОкно;
	Контент					= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Контент");
	Кэш.ТаблДок				= ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "Таблица_НоменклатураКонтрагентов");
	Контент.ТекущаяСтраница	= ГлавноеОкно.сбисПолучитьСтраницу(Контент, "РеестрСправочников");	
		
	СтраницыПанели = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш,, ИмяРаздела + "_Подразделы");
	СтраницаОперацийРеестра = Кэш.ОбщиеФункции.СбисПолучитьЭлементФормы(Кэш, СтраницыПанели, ИмяРеестра);
	
	Если Не СтраницаОперацийРеестра = Неопределено Тогда
		СтраницыПанели.ТекущаяСтраница = СтраницаОперацийРеестра;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГлавноеОкно.КонтрагентНоменклатуры) Тогда
		Если Кэш.Ини.Конфигурация.Свойство("Контрагент") Тогда
			ИмяСправочника = СокрЛП(Сред(Кэш.Ини.Конфигурация.Контрагент.Значение, Найти(Кэш.Ини.Конфигурация.Контрагент.Значение, ".")+1));
			ТипСправочника = "СправочникСсылка."+ИмяСправочника;
		Иначе
			ТипСправочника = "СправочникСсылка.Контрагенты";
		КонецЕсли;
		ОписаниеТипа = Новый ОписаниеТипов(ТипСправочника);
		ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно,"КонтрагентНоменклатуры").ОграничениеТипа = ОписаниеТипа;
		ГлавноеОкно.КонтрагентНоменклатуры = ОписаниеТипа.ПривестиЗначение();
	КонецЕсли;

	Если ЗначениеЗаполнено(ГлавноеОкно.КонтрагентНоменклатуры) Тогда
		
		стрКонтрагент = ГлавноеОкно.сбисНайтиФормуФункции("сбисЗаполнитьСтруктуруКонтрагента","РаботаСДокументами1С").
							сбисЗаполнитьСтруктуруКонтрагента(ГлавноеОкно.КонтрагентНоменклатуры);	
       
		фрм = ГлавноеОкно.сбисНайтиФормуФункции("НоменклатураПоставщика_Список",Кэш.ФормаРаботыСНоменклатурой);
		
		стрФильтр = Новый Структура("Номенклатура, НаименованиеСБИС, GTIN, ИдСБИС");
		стрФильтр.НаименованиеСБИС	= ГлавноеОкно.ФильтрМаска;
		стрФильтр.Номенклатура		= ГлавноеОкно.ФильтрНоменклатура1С;
		стрФильтр.ИдСБИС			= ГлавноеОкно.ФильтрКодКонтрагента;
		стрФильтр.GTIN				= ГлавноеОкно.ФильтрGTIN; 
		
		стрНавигация = Новый Структура("Страница, РазмерСтраницы");
		
		Если ГлавноеОкно.ФильтрСтраница = 0 Тогда
			// По какой то причине на ОФ у кого-то первая страница по умолчанию "0" (сами не меняем)
			ГлавноеОкно.ФильтрСтраница = 1;
		КонецЕсли;
		стрНавигация.Страница		= ГлавноеОкно.ФильтрСтраница; //На апи отсчет страниц с 0, если на дбф с 1, перенести -1 в форму апи		
		стрНавигация.РазмерСтраницы = ГлавноеОкно.ЗаписейНаСтранице;
		
		ПараметрыСписка = Новый Структура("Контрагент, Навигация, Фильтр",стрКонтрагент, стрНавигация, стрФильтр);
		Попытка
			СписокНоменклатуры = фрм.НоменклатураПоставщика_Список(ПараметрыСписка,	Новый Структура("Кэш",Кэш));
			ГлавноеОкно.сбисЗаполнитьСписокСправочникаНоменклатурыКонтрагентов(СписокНоменклатуры);
		Исключение
			МодульОбъектаКлиент().СообщитьСбисИсключение(ИнформацияОбОшибке(), "Раздел_Справочники_НоменклатураКонтрагентов.ОбновитьКонтент");
		КонецПопытки;

	КонецЕсли;
	
	Кэш.ОбщиеФункции.ОбновитьПанельНавигации(Кэш);
	
КонецФункции

Функция ОбновитьКонтентПодговитьРаздел(ПараметрыОбновления, ДопПараметры) Экспорт

	Кэш = ДопПараметры.Кэш;
	
	НаСменуРаздела(Кэш);
	
	НастроитьКолонки(Кэш);
	НавигацияУстановитьПанель(Кэш);
	// Пока скрыли фильтры, т.к. не требуется (но заложено)
	сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельФильтра").Видимость = Ложь;
	сбисЭлементФормы(Кэш.ГлавноеОкно,"ПоказатьПанельФильтра").Видимость = Ложь;

	Возврат Истина;

КонецФункции

Процедура НастроитьКолонки(Кэш) Экспорт      
	// Процедуру не удалять.
КонецПроцедуры

Процедура НавигацияУстановитьПанель(ЛокальныйКэш=Неопределено) Экспорт
	ГлавноеОкно = ЛокальныйКэш.ГлавноеОкно;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ПанельНавигации").Видимость		= Истина;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ЗаписейНаСтранице1С").Видимость	= Ложь;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ЗаписейНаСтранице").Видимость	= Истина;
	ГлавноеОкно.сбисЭлементФормы(ГлавноеОкно, "ОбновитьСтатусы").Видимость		= Ложь;
КонецПроцедуры

Процедура НаСменуРаздела(ЛокальныйКэш) Экспорт
	Кэш = ЛокальныйКэш;
	ГлавноеОкно = Кэш.ГлавноеОкно;
	
	ПанельМассовыхОпераций = Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно, "ПанельМассовыхОпераций");
	Попытка
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Справочники" + Кэш.Текущий.ТипДок);
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельТулбар").Видимость = Истина;
	Исключение
		ПанельМассовыхОпераций.ТекущаяСтраница = Кэш.ГлавноеОкно.сбисПолучитьСтраницу(ПанельМассовыхОпераций,"Справочники");
		Кэш.ГлавноеОкно.сбисЭлементФормы(Кэш.ГлавноеОкно,"ПанельТулбар").Видимость = Истина;
	КонецПопытки;	
	
	КнопкаИмя = "СправочникиОтправить";
	ГлавноеОкно.сбисОчиститьПанельКнопок(Новый Структура("Имя, УправляемоеПриложение", КнопкаИмя, Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение), Ложь);
	
	ФильтрОчистить(Кэш);
КонецПроцедуры

// Процедура устанавливает значения фильтра по-умолчанию для текущего раздела	
Процедура ФильтрОчистить(Кэш) Экспорт
	ГлавноеОкно = Кэш.ГлавноеОкно;
	ОписанияТипов	= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	Если ОписанияТипов.Свойство("ФильтрНоменклатура1С") Тогда
		ГлавноеОкно.ФильтрНоменклатура1С = ОписанияТипов.ФильтрНоменклатура1С.ПривестиЗначение();
	Иначе	
		ГлавноеОкно.ФильтрНоменклатура1С = "";
	КонецЕсли;
	ГлавноеОкно.ФильтрМаска = "";
	ГлавноеОкно.ФильтрКодКонтрагента = "";
	ГлавноеОкно.ФильтрGTIN = "";
КонецПроцедуры

// Функция - значения для фильтра раздела Номенклатура по-умолчанию
//
// Параметры:
//  СтруктураРазделаГО	 - СтруктураРазделаГО	 - экземпляр класса раздел
// 
// Возвращаемое значение:
//  Структура - Параметры фильтра для раздела
//
&НаКлиенте
Функция  ЗначенияДляФильтрПоУмолчанию(СтруктураРазделаГО) Экспорт
	
	Кэш			= МодульОбъектаКлиент().ПолучитьТекущийЛокальныйКэш();
	ГлавноеОкно	= Кэш.ГлавноеОкно;
		
	ТипыПолейФильтра		= МодульОбъектаКлиент().ПолучитьЗначениеПараметраТекущегоСеанса("ТипыПолейФильтра");
	МодульСпискаСостояний	= МодульОбъектаКлиент().НайтиФункциюСеансаОбработки("СписокСостоянийДокумента", СтруктураРазделаГО.ОписаниеРаздела.ФормыРаздела);
	СписокСостояний			= ?(МодульСпискаСостояний = Ложь, Новый СписокЗначений, МодульСпискаСостояний.СписокСостоянийДокумента());
	
	ПараметрыФильтра = Новый Структура;
		
	ПараметрыФильтра.Вставить("ФильтрМаска",			"");
	ПараметрыФильтра.Вставить("ФильтрНоменклатура",		ТипыПолейФильтра.ФильтрНоменклатура.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрТипНоменклатуры",	ТипыПолейФильтра.ФильтрТипНоменклатуры.ПривестиЗначение());
	ПараметрыФильтра.Вставить("ФильтрGTIN",				""); 
	ПараметрыФильтра.Вставить("ФильтрКодКонтрагента",	"");
	ПараметрыФильтра.Вставить("ФильтрСтраница",			1);
	ПараметрыФильтра.Вставить("ФильтрРазмерСтраницы",	50);
	
	Возврат ПараметрыФильтра;
	
КонецФункции

Процедура ФильтрУстановитьВидимость(ФормаФильтра) Экспорт
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьКонтрагентПодключен");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьОтветственный");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьТипыДокументов");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьМаска");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрКонтрагентПодключен");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрОтветственный");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрТипыДокументов");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрМаска");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьКонтрагент");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьОрганизация");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрКонтрагент");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрОрганизация");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрКонтрагентСФилиалами");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;    
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрСостояние");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;   
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрПериод");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли;  
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьФильтрПериод");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Ложь;
	КонецЕсли; 
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьНоменклатураКонтрагента");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Истина;
	КонецЕсли;    
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьНоменклатура1С");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Истина;
	КонецЕсли;   
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьКодКонтрагента");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Истина;
	КонецЕсли;  
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"НадписьGTIN");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Истина;
	КонецЕсли;   
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрНоменклатура1С");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Истина;
	КонецЕсли;   
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрКодКонтрагента");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Истина;
	КонецЕсли;  
	ВыбранныйЭлемент = сбисЭлементФормы(ФормаФильтра,"ФильтрGTIN");
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВыбранныйЭлемент.Видимость = Истина;
	КонецЕсли; 
КонецПроцедуры
