
// Формирование элементов формы
//
// Параметры:
//  ПараметрыФормирования - Структура - Описание элементов формы:
//    - Элементы (структура):
//      - Имя (Ключ структуры)
//      - Заголовок (Строка)
//      - Тип (ОписаниеТипа)
//      - ПодчиненныеЭлементы (Структура) ??????????
//    - Команды (Структура):
//      - Имя (Ключ структуры)
//      - Заголовок (Строка)
//      - Обработчик (СбисОписаниеОповещания)
//
&НаСервере
Процедура СформироватьКонтекстФормы(ПараметрыФормирования)
	
	ЭлементыФормы.Очистить();
	
	ПодготовитьЭлементыФормы(ПараметрыФормирования);

КонецПроцедуры

&НаСервере
Процедура ПодготовитьЭлементыФормы(ПараметрыФормирования)
	
	КэшФормированияФормы = Новый Структура;
	КэшФормированияФормы.Вставить("Ширина",								ЭтаФорма.Ширина);
	КэшФормированияФормы.Вставить("Высота",								ЭтаФорма.Высота);
	КэшФормированияФормы.Вставить("ОтступыПоВертикали",					2);
	КэшФормированияФормы.Вставить("ОтступыПоГоризонтали",				4);
	КэшФормированияФормы.Вставить("ТекущийЛевыйКрай",					КэшФормированияФормы.ОтступыПоГоризонтали);
	КэшФормированияФормы.Вставить("ТекущийВерхнийКрай",					КэшФормированияФормы.ОтступыПоВертикали);
	КэшФормированияФормы.Вставить("ОтступМеждуЭлементамиПоГоризонтали",	4);
	КэшФормированияФормы.Вставить("ОтступМеждуЭлементамиПоВертикали",	6);
	КэшФормированияФормы.Вставить("ВысотаЭлементов",					20);
	КэшФормированияФормы.Вставить("ШиринаЭлементов", КэшФормированияФормы.Ширина
													- 3 * КэшФормированияФормы.ОтступыПоГоризонтали);
	КэшФормированияФормы.Вставить("ШиринаНадписей",	Цел(КэшФормированияФормы.ШиринаЭлементов * 0.3)
													- КэшФормированияФормы.ОтступМеждуЭлементамиПоГоризонтали);
																	
	ОписаниеКоманднаяСтрока = Новый Структура("Имя, Тип, Высота", "КоманднаяПанельФормы", "КоманднаяПанель", 36);
	КоманднаяПанельНовая = ДобавитьЭлементФормы(КэшФормированияФормы, ОписаниеКоманднаяСтрока);
	
	КоманднаяПанельНовая.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ЭтаФорма.Панель, ГраницаЭлементаУправления.Верх); 
	КоманднаяПанельНовая.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭтаФорма.Панель, ГраницаЭлементаУправления.Верх); 
	КоманднаяПанельНовая.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭтаФорма.Панель, ГраницаЭлементаУправления.Лево); 
	КоманднаяПанельНовая.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭтаФорма.Панель, ГраницаЭлементаУправления.Право);
	
	Для каждого КомандаОписание Из ПараметрыФормирования.Команды Цикл
		
		ДействиеОтправить = Новый Действие("Отправить");
		КоманднаяПанельНовая.Кнопки.Добавить(КомандаОписание.Ключ,
											ТипКнопкиКоманднойПанели.Действие,
											КомандаОписание.Значение.Заголовок,
											ДействиеОтправить);
		
	КонецЦикла;
	
	Для каждого ЭлементОписание Из ПараметрыФормирования.Элементы Цикл
		
		// Наддпись
		ОписаниеНадписи = Новый Структура("Имя, Тип", ЭлементОписание.Ключ + "Название", "Надпись");
		ОписаниеНадписи.Вставить("Ширина", КэшФормированияФормы.ШиринаНадписей);
		ОписаниеНадписи.Вставить("Свойства", Новый Структура);
		ОписаниеНадписи.Свойства.Вставить("Заголовок", ЭлементОписание.Значение.Заголовок);
		ОписаниеНадписи.Свойства.Вставить("Шрифт", Новый Шрифт("Tahoma", 10));
		ОписаниеНадписи.Свойства.Вставить("ЦветТекста", Новый Цвет(153, 153, 153));
		
		ДопПараметрыНадписи = Новый Структура("СдвигВправо", КэшФормированияФормы.ОтступМеждуЭлементамиПоГоризонтали);
		ЭлементНадписьНовый = ДобавитьЭлементФормы(КэшФормированияФормы, ОписаниеНадписи, ДопПараметрыНадписи);
		
		ЭлементНадписьНовый.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ЭтаФорма.Панель, ГраницаЭлементаУправления.Верх); 
		ЭлементНадписьНовый.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭтаФорма.Панель, ГраницаЭлементаУправления.Верх); 
		ЭлементНадписьНовый.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭтаФорма.Панель, ГраницаЭлементаУправления.Лево); 
		ЭлементНадписьНовый.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭтаФорма.Панель, ГраницаЭлементаУправления.Лево);
		
		// Поле ввода
		ОписаниеЭлемента = Новый Структура("Имя, Тип", ЭлементОписание.Ключ, "ПолеВвода");
		ОписаниеЭлемента.Вставить("Ширина", КэшФормированияФормы.ШиринаЭлементов
											- КэшФормированияФормы.ШиринаНадписей
											- КэшФормированияФормы.ОтступМеждуЭлементамиПоГоризонтали);
		ОписаниеЭлемента.Вставить("Свойства", Новый Структура);
		Если НЕ ЭлементОписание.Значение.Свойство("Свойства", ОписаниеЭлемента.Свойства) Тогда
			ОписаниеЭлемента.Свойства = Новый Структура;
		КонецЕсли; 
		ОписаниеЭлемента.Свойства.Вставить("ОграничениеТипа", ЭлементОписание.Значение.Тип);
		ОписаниеЭлемента.Свойства.Вставить("ТипЗначения", ЭлементОписание.Значение.Тип);
		ОписаниеЭлемента.Свойства.Вставить("ЦветФонаКнопки", Новый Цвет(255, 255, 255)); 
		ОписаниеЭлемента.Свойства.Вставить("ЦветТекстаКнопки", Новый Цвет(153, 153, 153)); 
		ОписаниеЭлемента.Свойства.Вставить("ЦветРамки", Новый Цвет(153, 153, 153));
		ДопПараметрыПоля = Новый Структура;
		ДопПараметрыПоля.Вставить("СдвигВлево",
			КэшФормированияФормы.ШиринаНадписей + КэшФормированияФормы.ОтступМеждуЭлементамиПоГоризонтали);
		ДопПараметрыПоля.Вставить("СдвигВниз", КэшФормированияФормы.ОтступМеждуЭлементамиПоВертикали);
		ЭлементНовый = ДобавитьЭлементФормы(КэшФормированияФормы, ОписаниеЭлемента, ДопПараметрыПоля);
		
		ЭлементНовый.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ЭтаФорма.Панель, ГраницаЭлементаУправления.Верх); 
		ЭлементНовый.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭтаФорма.Панель, ГраницаЭлементаУправления.Верх); 
		ЭлементНовый.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭтаФорма.Панель, ГраницаЭлементаУправления.Лево); 
		ЭлементНовый.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭтаФорма.Панель, ГраницаЭлементаУправления.Право);
		
		Если ЭлементОписание.Значение.Свойство("ТипЗначения") Тогда
			ЭлементНовый.ТипЗначенияСписка = ЭлементОписание.Значение.ТипЗначения;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ИзмененияФормы", Новый Структура);
	ПараметрыФормы.ИзмененияФормы.Вставить("Высота", КэшФормированияФормы.ТекущийВерхнийКрай
													+ КэшФормированияФормы.ВысотаЭлементов
													+ КэшФормированияФормы.ОтступМеждуЭлементамиПоВертикали);
	ПараметрыФормы.ИзмененияФормы.Вставить("Ширина", КэшФормированияФормы.Ширина);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементФормы(КэшФормированияФормы, ОписаниеЭлемента, ДопПараметры = Неопределено)
	Перем ШиринаЭлемента, ВысотаЭлемента;
	
	Если НЕ (ОписаниеЭлемента.Свойство("Тип")
		И ОписаниеЭлемента.Свойство("Имя")) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	Если НЕ ОписаниеЭлемента.Свойство("Ширина", ШиринаЭлемента)  Тогда 
		КэшФормированияФормы.Свойство("ШиринаЭлементов", ШиринаЭлемента);
	КонецЕсли;
	
	Если НЕ ОписаниеЭлемента.Свойство("Высота", ВысотаЭлемента)  Тогда 
		КэшФормированияФормы.Свойство("ВысотаЭлементов", ВысотаЭлемента);
	КонецЕсли;
	
	НовыйЭлемент = ЭлементыФормы.Добавить(Тип(ОписаниеЭлемента.Тип), ОписаниеЭлемента.Имя, Истина);
	НовыйЭлемент.Ширина = ШиринаЭлемента;
	НовыйЭлемент.Лево = КэшФормированияФормы.ТекущийЛевыйКрай;
	НовыйЭлемент.Высота = КэшФормированияФормы.ВысотаЭлементов;
	НовыйЭлемент.Верх = КэшФормированияФормы.ТекущийВерхнийКрай;
    
	
    Если ОписаниеЭлемента.Свойство("Свойства") Тогда
        
        СписокВыбора = Неопределено;
        Если ОписаниеЭлемента.Свойства.Свойство("СписокВыбора", СписокВыбора) Тогда
        	ОписаниеЭлемента.Свойства.Удалить("СписокВыбора");
        КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОписаниеЭлемента.Свойства);
		
		Если СписокВыбора <> Неопределено Тогда
			Для каждого ЭлементСписка Из СписокВыбора Цикл
				НовыйЭлемент.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
	СдвигПоВертикали	= 0;
	СдвигПоГоризонтали	= 0;
	
	Если ДопПараметры.Свойство("СдвигВправо") Тогда
		СдвигПоГоризонтали = СдвигПоГоризонтали + ШиринаЭлемента + ДопПараметры.СдвигВправо;
	КонецЕсли;
	
	Если ДопПараметры.Свойство("СдвигВниз") Тогда
		СдвигПоВертикали = СдвигПоВертикали + ВысотаЭлемента + ДопПараметры.СдвигВниз;
	КонецЕсли;
	
	Если ДопПараметры.Свойство("СдвигВлево") Тогда
		СдвигПоГоризонтали = - СдвигПоГоризонтали - ДопПараметры.СдвигВлево;
	КонецЕсли;
	
	Если ДопПараметры.Свойство("СдвигВверх") Тогда
		СдвигПоВертикали = - СдвигПоВертикали - ДопПараметры.СдвигВверх;
	КонецЕсли;
	
	Если НЕ СдвигПоВертикали И НЕ СдвигПоГоризонтали Тогда
		СдвигПоВертикали = ВысотаЭлемента + КэшФормированияФормы.ОтступМеждуЭлементамиПоВертикали;
	КонецЕсли;
	
	КэшФормированияФормы.ТекущийЛевыйКрай	= КэшФормированияФормы.ТекущийЛевыйКрай		+ СдвигПоГоризонтали;
	КэшФормированияФормы.ТекущийВерхнийКрай	= КэшФормированияФормы.ТекущийВерхнийКрай	+ СдвигПоВертикали;
	
	Возврат НовыйЭлемент;
	
КонецФункции

