
&НаСервере
Функция ПриОбновленииМодуля(НазваниеПродукта, ВерсияПродукта, ОбщиеНастройки)

	ИнициализацияОбщихНастроекБД(ОбщиеНастройки);

	Возврат ОбщиеНастройки;
КонецФункции 

Функция ПолучитьПубличныеНастройкиПоУмолчанию() Экспорт
	ПубличныеОбщиеНастройки	= Новый Структура();
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_complete",		Истина);
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_update",			Истина);
	ПубличныеОбщиеНастройки.Вставить("refresh_statuses",						Ложь);
	ПубличныеОбщиеНастройки.Вставить("run_docflow",								Истина);
	ПубличныеОбщиеНастройки.Вставить("kedo_mark",								Истина);
	ПубличныеОбщиеНастройки.Вставить("send_invitations",						Истина);
	ПубличныеОбщиеНастройки.Вставить("send_completed_documents",				Истина);
	ПубличныеОбщиеНастройки.Вставить("pdf_attachments",							Ложь);
	Возврат ПубличныеОбщиеНастройки;
КонецФункции

Процедура ИнициализацияОбщихНастроекБД(ОбщиеНастройки)
	Если ТипЗнч(ОбщиеНастройки) <> Тип("Структура") Тогда
		ОбщиеНастройки = Новый Структура();
	КонецЕсли;
	
	ПубличныеОбщиеНастройки = get_prop(ОбщиеНастройки, "public", Новый Структура);
	ПубличныеНастройкиПоУмолчанию = ПолучитьПубличныеНастройкиПоУмолчанию();
	//Обновим список настроек новыми параметрами если они появились в новой версии расширения
	//или заполним значениями по умолчанию в лучае их отсутствия у пользоваетеля
	Для Каждого КлючЗначениеПараметра Из ПубличныеНастройкиПоУмолчанию Цикл
		Если get_prop(ПубличныеОбщиеНастройки, КлючЗначениеПараметра.Ключ) = Неопределено Тогда
			ПубличныеОбщиеНастройки.Вставить(КлючЗначениеПараметра.Ключ, КлючЗначениеПараметра.Значение);
		КонецЕсли;
	КонецЦикла;
	ОбщиеНастройки.Вставить("public", ПубличныеОбщиеНастройки);
	
	//Заполним	версию расширения, для проверки обновления
	ВерсияРасширения	= "0.0.0";
	Если НЕ ОбщиеНастройки.Свойство("ВерсияРасширения", ВерсияРасширения) Тогда
		ВерсияРасширения	= "0.0.0";
		ОбщиеНастройки.Вставить("ВерсияРасширения", ВерсияРасширения);
	КонецЕсли;
КонецПроцедуры


