
Функция ПриНачалеРаботы() Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
//	context_param = НастройкиПодключенияПрочитать();

	НазваниеПродукта = НазваниеПродукта();
	ВерсияПродукта = ПолучитьИмяФайлаИНомерТекущейВерсии()[1];

	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	
	Если get_prop(ОбщиеНастройки, "ExtSysUid") = Неопределено Тогда  // для перехода, удалить после версии ...
		ОбщиеНастройки.Вставить("ExtSysUid", get_prop(ОбщиеНастройки, "system_uuid", СокрЛП(Новый УникальныйИдентификатор)));
	КонецЕсли;
		
	Если get_prop(ОбщиеНастройки, "Версия" + НазваниеПродукта) <> ВерсияПродукта Тогда
		ОбщиеНастройки = ПриОбновленииМодуля(НазваниеПродукта, ВерсияПродукта, ОбщиеНастройки);
		ОбщиеНастройки.Вставить("Версия" + НазваниеПродукта, ВерсияПродукта);
	КонецЕсли;
	
	// аналогично при необходимости сделать для версии конфигурации = имя параметра "ВерсияКонфигурации"
	//СистемнаяИнформация = Новый СистемнаяИнформация;
	//СовместимостьМетодов = НовыйСовместимостьМетодов(СистемнаяИнформация.ВерсияПриложения);
	//ГлобальныйКэш = Новый Структура();
	//ГлобальныйКэш.Вставить("СовместимостьМетодов", СовместимостьМетодов);
	//ГлобальныйКэшЗаписать(ГлобальныйКэш);
	
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ОбщиеНастройки;
 
КонецФункции

Функция СервисПоУмолчанию() Экспорт
	Возврат "https://online.saby.ru";
КонецФункции

Функция ТемаПоУмолчанию() Экспорт
	Возврат "1С";
КонецФункции	

