
//////////////////////////////////////////////////////////////////////////////////

////////////////////// Обычное приложение/////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
Процедура сбисЗаписатьИзменения(Стр, СтруктураАдреса)
	Контрагент = Стр.Контрагент;
	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Контрагент.Ссылка);
	Набор.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	Набор.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Набор.Прочитать();
	// Юридический
	Если Набор.Количество()=0 Тогда
		Запись = Набор.Добавить();
		Запись.Объект     = Контрагент.Ссылка;
		Запись.Тип         = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Запись.Вид         = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	Иначе
		Запись = Набор.Получить(0);	
	КонецЕсли;
	Запись.Поле1 = СтруктураАдреса.Индекс;				// записываем индекс
	Запись.Поле2 = СтруктураАдреса.Регион; 			    // записываем регион
	Запись.Поле3 = СтруктураАдреса.Район; 				// записываем район
	Запись.Поле4 = СтруктураАдреса.Город; 				// записываем город
	Запись.Поле5 = СтруктураАдреса.НаселПункт;			// записываем насленный пункт
	Запись.Поле6 = СтруктураАдреса.Улица;				// записываем улицу
	Запись.Поле7 = СтруктураАдреса.Дом;					// записываем дом
	Запись.Поле8 = СтруктураАдреса.Корпус;				// записываем корпус
	Запись.Поле9 = СтруктураАдреса.Квартира;			// записываем квартиру      
	//Запись.Поле10 = ""; 				// непонятно что в адресе сюда записывается 
	Запись.ТипДома     = СтруктураАдреса.ТипДома;
	Запись.ТипКвартиры = СтруктураАдреса.ТипКвартиры;
	Запись.ТипКорпуса  = СтруктураАдреса.ТипКорпуса;
	Запись.Представление = СбиСПолучитьПредставлениеАдрес(СтруктураАдреса);			//  
	Набор.Записать(Истина);
КонецПроцедуры

Процедура сбисЗаполнитьСтруктуруАдреса(Контрагент, СтруктураАдреса)
	НаборКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборКИ.Отбор.Объект.Установить(Контрагент);
	НаборКИ.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	НаборКИ.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	НаборКИ.Прочитать();
	
	Для Каждого ЗаписьАдрес Из НаборКИ Цикл
		СтруктураАдреса.Индекс = ЗаписьАдрес.Поле1; 
		СтруктураАдреса.Регион = ЗаписьАдрес.Поле2; 
		СтруктураАдреса.Район = ЗаписьАдрес.Поле3; 
		СтруктураАдреса.Город = ЗаписьАдрес.Поле4; 
		СтруктураАдреса.НаселПункт = ЗаписьАдрес.Поле5; 
		СтруктураАдреса.Улица = ЗаписьАдрес.Поле6; 
		СтруктураАдреса.Дом = ЗаписьАдрес.Поле7; 
		СтруктураАдреса.Корпус = ЗаписьАдрес.Поле8; 
		СтруктураАдреса.Квартира = ЗаписьАдрес.Поле9; 
		СтруктураАдреса.Представление = ЗаписьАдрес.Представление;
	КонецЦикла;
КонецПроцедуры

Процедура КнопкаОтметитьВсеНажатие(Элемент)
	ОтметитьВсе();
КонецПроцедуры

