
&НаКлиенте
Процедура СформироватьТаблица(ГруппировкаКолонок, Префикс = "", ПоложениеКолонкиИмя = "НоваяКолонка")
	
	Если Не ЗначениеЗаполнено(ГруппировкаКолонок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяКолонки Из ГруппировкаКолонок["_Порядок"] Цикл
		
		СтруктураКолонки = ГруппировкаКолонок[ИмяКолонки];
		ТипКолонки = ?(Не ТипЗнч(СтруктураКолонки) = Тип("Соответствие"), Новый ОписаниеТипов(СтруктураКолонки), Неопределено); 
		НовКолонка = ЭлементыФормы.ТаблДок.Колонки.Добавить(Префикс + ИмяКолонки, Синоним(ИмяКолонки));
		НовКолонка.Данные = Префикс + ИмяКолонки;
		НовКолонка.Положение = ПоложениеКолонки[ПоложениеКолонкиИмя];
		НовКолонка.ОтображатьВШапке = Не ЗначениеЗаполнено(Префикс);
		
		Если ТипЗнч(СтруктураКолонки) = Тип("Соответствие") Тогда
			
			СформироватьТаблица(СтруктураКолонки, ИмяКолонки, "НаСледующейСтроке");
			Продолжить;
			
		КонецЕсли;
		
		ТаблДок.Колонки.Добавить(Префикс + ИмяКолонки, ТипКолонки, ИмяКолонки);
		
	КонецЦикла;

КонецПроцедуры

