&НаКлиенте
Функция сбисЭлементФормы(Форма,ИмяЭлемента)
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		Возврат Форма.Элементы.Найти(ИмяЭлемента);
	КонецЕсли;
	Возврат Форма.ЭлементыФормы.Найти(ИмяЭлемента);
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент() Экспорт
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Процедура сбисОформлениеДопПолейРеестра(Кэш) Экспорт
	сбисЭлементФормы(Кэш.ГлавноеОкно,"Таблица_РеестрДокументов").Колонки.Срок.Видимость = Истина;
	сбисЭлементФормы(Кэш.ГлавноеОкно,"Таблица_РеестрДокументов").Колонки.Лицо2.Видимость = Истина;
	сбисЭлементФормы(Кэш.ГлавноеОкно,"Таблица_РеестрДокументов").Колонки.Лицо2.ТекстШапки = "Грузополучатель";
КонецПроцедуры


// Процедура - показывает дополнительный аккордеон
//
// Параметры:
//  Кэш	 - Структура - Кэш обработки 
//
&НаКлиенте
Процедура ВывестиДополнительныйАккордеон(Кэш) Экспорт
	Форма = Кэш.ГлавноеОкно;		
	Если Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость = Истина;
	ИначеЕсли Не МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость Тогда
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Видимость = Истина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Ширина = 
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Ширина 
		- МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Ширина;
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Лево = 
		МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "Контент").Лево 
		+ МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(Форма, "АккордеонДополнительныйHTML").Ширина;
	КонецЕсли;
КонецПроцедуры	