
Функция сбисПараметрыМассыПрописью(Масса) Экспорт
	КоэффициентПересчетаВТонны     = Константы.КоэффициентПересчетаВТонны.Получить();
	МассаТонны = Масса * КоэффициентПересчетаВТонны;
	Если МассаТонны > 1 Тогда
		Коэффициент = 1;
		СтрокаФормат = "т, т, т, ж, кг, кг, кг, м, " + ?(Окр(МассаТонны) = МассаТонны, "0", "3");
	ИначеЕсли МассаТонны * 1000 > 1 Тогда
		Коэффициент = 1000;
		СтрокаФормат = "кг, кг, кг, м, г, г, г, м, " + ?(Окр(МассаТонны * Коэффициент) = МассаТонны * Коэффициент, "0", "3");
	Иначе
		Коэффициент = 1000000;
		СтрокаФормат = "г, г, г, м, г, г, г, м, 0";
	КонецЕсли;
	
	Возврат Новый Структура("Формат, Коэффициент", СтрокаФормат, Коэффициент*КоэффициентПересчетаВТонны);
	
КонецФункции

функция сбисОпределитьМассуИтогПрописью(МассаИтог) Экспорт
	Если ЗначениеЗаполнено(МассаИтог) Тогда
		ПараметрыМассыПрописью = сбисПараметрыМассыПрописью(МассаИтог);
		Возврат ЧислоПрописью(
			МассаИтог * ПараметрыМассыПрописью.Коэффициент,
			"ДП=Истина",
			ПараметрыМассыПрописью.Формат
		);
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

функция сбисОпределитьМассуИтогПрописьюНеупрПрил(МассаИтог) Экспорт
	ЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) И МассаИтог > 0 Тогда
		Возврат ЧислоПрописью(МассаИтог, ,",,,,,,,,0")+ " " +ЕдиницаИзмеренияВеса.Наименование + ".";
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции

функция сбисОпределитьМассуБруттоИтог(ТЧДок) Экспорт
	ЗаполненаЕдиницаИзмеренияВеса = ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить());
	Если ЗаполненаЕдиницаИзмеренияВеса Тогда
		МассаБруттоИтог = 0;
		Для Каждого СтрокаТЧ из ТЧДок Цикл
			Если СтрокаТЧ.Упаковка.Вес = 0 Тогда 
				МассаБруттоИтог = МассаБруттоИтог + СтрокаТЧ.Количество * СтрокаТЧ.Номенклатура.Вес
			Иначе 
				МассаБруттоИтог = МассаБруттоИтог +  СтрокаТЧ.КоличествоУпаковок * СтрокаТЧ.Упаковка.Вес
			КонецЕсли;		
		КонецЦикла;
		Возврат МассаБруттоИтог;
	Иначе
		Возврат 0
    КонецЕсли;		
КонецФункции

