
&НаКлиенте
Процедура ДополнительныеПараметрыДокументаПараметрНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДокументаСбис = МодульОбъектаКлиент().СоставПакета_Получить(СоставПакета, "ДопПараметрыСБИС");
	ТаблицаФормы = МодульОбъектаКлиент().ПолучитьЭлементФормыОбработки(ЭтаФорма, "ДополнительныеПараметрыДокумента");
	
	ТекущаяСтрока = ТаблицаФормы.ТекущиеДанные;
	ПараметрДокумента = МодульОбъектаКлиент().НайтиВМассивеСтруктурПоКлючу(ПараметрыДокументаСбис, ТекущаяСтрока.ИмяПараметра, "Имя");
	
	Если НЕ ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("СписокЗначений"))
		И НЕ ПараметрДокумента.ИнформацияОТипе.Тип.СодержитТип(Тип("СтандартныйПериод")) Тогда
	
		СтандартнаяОбработка = Истина;
		Возврат;
	
	КонецЕсли;
	
	ДополнительныеПараметрыДокументаПараметрНачалоВыбора_Общее();
	
КонецПроцедуры

