
Процедура ЗаписатьПересчеты(Кнопка)
	
	КоэффициентEDIВ1С = Окр(КоличествоЕдиниц1С / КоличествоЕдиницEDI, 3);
	
	Структура = Новый Структура("КоэффициентEDIВ1С", КоэффициентEDIВ1С);  
	
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

Процедура ПриОткрытии()
			
	ЭлементыФормы.НадписьКоличествоЕдиниц1С.Заголовок = Строка(ЕдиницаИзмерения) + " (1С)";
	ЭлементыФормы.НадписьКоличествоЕдиницEDI.Заголовок = ЕдиницаEDI + " (EDI)";
		
	КоличествоЕдиниц1С = КоэффициентEDIВ1С;
	КоличествоЕдиницEDI = ?(ЗначениеЗаполнено(КоэффициентEDIВ1С), 1, 0);
		
КонецПроцедуры 
